const 약관1 = `제1조 (목적) 

이 약관은 곱은달감귤체험농장(이하 "쇼핑몰"이라 칭함)이 운영하는 사이버 쇼핑몰(이하 "쇼핑몰"이라 함)에서 제공하는 인터넷 관련 서비스(이하 "서비스"라 한다)의 이용에 있어 쇼핑몰과 이용자의권리·의무 및 책임사항을 규정하여 고객 권익을 보호함을 목적으로 합니다.
 
제2조 (정의) 

1. "쇼핑몰" 이란 회사가 재화 또는 용역을 이용자에게 제공하기 위하여 컴퓨터등 정보통신설비를 이용하여 재화 또는 용역을 거래할 수 있도록 설정한 가상의 영업장을 말하며, 아울러 쇼핑몰을 운영하는 회사의 의미로도 사용합니다.
2. "이용자"란 "쇼핑몰"에 접속하여 이 약관에 따라 "쇼핑몰"이 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
3. 회원'이라 함은 "쇼핑몰"에 개인정보를 제공하여 회원등록을 한 자로서, "쇼핑몰"의 정보를 지속적으로 제공받으며,"쇼핑몰"이 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.
4. 비회원'이라 함은 회원에 가입하지 않고 "쇼핑몰"이 제공하는 서비스를 이용하는 자를 말합니다.
 
 제3조 (약관의 명시와 개정)
 
1. "쇼핑몰"은 이 약관의 내용과 상호, 영업소 소재지, 대표자의 성명, 사업자등록번호, 연락처 (전화, 팩스, 전자우편 주소 등) 등을 이용자가 알 수 있도록 쇼핑몰의 서비스 초기 화면에 게시합니다.
2. "쇼핑몰"은 약관의규제등에관한법률, 전자거래기본법, 전자서명법, 정보통신망이용촉진등에 관한법률, 방문판매등에 관한법률, 소비자보호법 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
3. "쇼핑몰"이 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 쇼핑몰의 초기화면에 개정사실을 그 적용일자 7일 전부터 공지하되, 동 기간동안 개정된 약관의 내용을 현행약관이 게시되는 서비스 화면에 함께 게시합니다.
4. "쇼핑몰"이 약관을 개정할 경우에는 개정되는 약관은 그 약관이 적용되는 날 이후에 체결되는 계약에만 적용되고 이전에 이미 체결된 계약에 대해서는 개정 이전의 약관조항이 그대로 적용됩니다. 다만 이미 계약을 체결한 이용자가 개정약관 조항의 적용을 받기를 원하는 뜻을 상기 제3항에서 정한 개정약관의 공지기간 내에 '쇼핑몰"에 송신하여 "쇼핑몰"의 동의를 받은경우에는 개정약관 조항이 적용됩니다.
5. 이 약관에서 정하지 않은 사항과 이 약관의 해석에 관하여는 정부가 제정한 전자거래소비자보호지침 및 관계법령 또는 상관례에 따릅니다. 
 
 제4조 (서비스의 제공 및 변경)
 
1. "쇼핑몰"은 다음과 같은 업무를 수행합니다.
① 재화 또는 용역에 대한 정보 제공 및 구매계약의 체결
② 구매계약이 체결된 재화 또는 용역의 배송
③ 기타 "쇼핑몰"이 정하는 업무
2. "쇼핑몰"은 재화의 품절 또는 기술적 사양의 변경 등의 경우에는 장차 체결되는 계약에 의해 제공할 재화·용역의 내용을 변경할 수 있습니다.
이 경우에는 변경된 재화·용역의 내용 및 제공일자를 명시하여 현재의 재화·용역의 내용을 게시한 곳에 그 제공일자 이전 7일부터 공지합니다.
3. "쇼핑몰"이 제공하기로 이용자와 계약을 체결한 서비스의 내용을 재화의 품절 또는 기술적 사양의 변경 등의 사유로 변경할 경우에는 "쇼핑몰"은 이로 인하여 이용자가 입은 손해를 배상합니다. 단, "쇼핑몰"에 고의 또는 과실이 없는 경우에는 그러하지 아니합니다.

 제5조 (서비스의 중단) 
 
 1. "쇼핑몰"은 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
2. 상기 제1항에 의한 서비스 중단의 경우에는 "쇼핑몰"은 제8조에 정한 방법으로 이용자에게 통지합니다.
3. "쇼핑몰"이 제공하기로 이용자와 계약을 체결한 서비스의 내용을 재화의 품절 또는 기술적 사양의 변경 등의 사유로 변경할 경우에 "쇼핑몰"은 이로 인하여 이용자가 입은 손해를 배상합니다.
단 "쇼핑몰"의 고의 또는 과실이 없는 경우는 그러하지 아니합니다.
 
 제6조 (회원가입) 
  
 1. 이용자는 "쇼핑몰"이 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.
2. "쇼핑몰"은 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다. 단, 회원등록을 위해 수집된 정보는 '회사'가 운영하는 TV홈쇼핑, 카달로그 통신판매의 회원정보와 통합되어 관리됩니다.
① 가입신청자가 이 약관 제7조 제3항에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 다만 제7조 제3항에 의한 회원자격 상실 후 3년이 경과한 자로서 "쇼핑몰"의 회원재가입 승낙을 얻은 경우에는 예외로 합니다.
② 등록 내용에 허위, 기재누락, 오기가 있는 경우
③ 기타 회원으로 등록하는 것이 "쇼핑몰"의 기술상 현저히 지장이 있다고 판단되는 경우
3. 회원가입계약의 성립시기는 "쇼핑몰"의 승낙이 회원에게 도달한 시점으로 합니다.
4. 회원은 제15조제1항에 의한 등록사항에 변경이 있는 경우, 즉시 전자우편 기타 방법으로 "쇼핑몰"에 대하여 그 변경사항을 알려야 합니다.
이러한 변경사항의 미통보로 인해 발생한 손해는 회원에게 그 책임이 있습니다.

 제7조 (회원 탈퇴 및 자격 상실 등) 
  
 1. 회원은 "쇼핑몰"에 언제든지 탈퇴를 요청할 수 있으며 "쇼핑몰"은 즉시 회원탈퇴를 처리합니다.
2. 회원이 다음 각 호의 사유에 해당하는 경우, "쇼핑몰"은 회원자격을 제한 및 정지시킬 수 있습니다. 
① 가입 신청시에 허위 내용을 등록한 경우
② "쇼핑몰"을 이용하여 구입한 재화·용역 등의 대금, 기타 "쇼핑몰" 이용에 관련하여 회원이 부담하는 채무를 기일에 지급하지 않는 경우
③ 다른 사람의 "쇼핑몰" 이용을 방해하거나 그 정보를 도용하는 등 전자거래질서를 위협하는 경우 "쇼핑몰"을 이용하여 법령과 이 약관이 금지하는 행위를 하거나 공서양속에 반하는 행위를 하는 경우
3. "쇼핑몰"이 회원 자격을 제한·정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 "쇼핑몰"은 회원자격을 상실시킬 수 있습니다.
4. "쇼핑몰"이 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록 말소 전에 소명할 기회를 부여합니다.
 
 제8조 (회원에 대한 통지) 
 
 1. "쇼핑몰"이 회원에 대한 통지를 하는 경우, 회원이 "쇼핑몰"에 제출한 전자우편 주소로 할 수 있습니다.
2. "쇼핑몰"은 불특정다수 회원에 대한 통지의 경우 1주일이상 "쇼핑몰" 게시판에 게시함으로서 개별 통지에 갈음할 수 있습니다.

 제9조 (구매신청) 
 
 "쇼핑몰"이용자는 "쇼핑몰"상에서 이하의 방법에 의하여 구매를 신청합니다.
① 성명, 주소, 전화번호 입력
② 재화 또는 용역의 선택
③ 결제방법의 선택
④ 이 약관에 동의한다는 표시 (예, 마우스클릭 등)
 
 제10조 (계약의 성립) 
  
 1. "쇼핑몰"은 제9조와 같은 구매신청에 대하여 다음 각 호에 해당하지 않는 한 승낙합니다.
① 신청 내용에 허위, 기재누락, 오기가 있는 경우
② 미성년자가 담배, 주류등 청소년보호법에서 금지하는 재화 및 용역을 구매하는 경우
③ 기타 구매신청에 승낙하는 것이 "쇼핑몰" 기술상 현저히 지장이 있다고 판단하는 경우
2. "쇼핑몰"의 승낙이 제12조제1항의 수신확인통지형태로 이용자에게 도달한 시점에 계약이 성립한 것으로 봅니다.

 제11조 (지급방법) 
 
 "쇼핑몰"에서 구매한 재화 또는 용역에 대한 대금지급방법은 다음 각 호의 하나로 할 수
있습니다. 단, 이의 운영방식은 회사가 정한 바에 의합니다.
① 계좌이체
② 신용카드결제
③ 온라인무통장입금
④ 전자화폐에 의한 결제
⑤ 수령시 대금지급 등
 
 제12조 (수신확인통지런만탐택?변경 및 취소) 
 
 1. "쇼핑몰"은 이용자의 구매신청이 있는 경우 이용자에게 수신확인통지를 합니다.
2. 수신확인통지를 받은 이용자는 의사표시의 불일치등이 있는 경우에는 수신확인통지를
받은 후 즉시 구매신청 변경 및 취소를 요청할 수 있습니다.
3. "쇼핑몰"은 배송 전 이용자의 구매신청 변경 및 취소 요청이 있는 때에는 지체없이
그 요청에 따라 처리합니다.
 
 제13조 (배송) 
  
 "쇼핑몰"은 이용자가 구매한 재화에 대해 배송수단, 수단별 배송비용 부담자, 수단별 배송기간등을 명시합니다. 만약 "쇼핑몰"의 고의·과실로 약정 배송기간을 초과한 경우에 그로 인한 이용자의 손해를 배상합니다.
 
 제14조 (환급, 반품 및 교환) 
 
 1. "쇼핑몰"은 이용자가 구매신청한 재화 또는 용역이 품절 등의 사유로 재화의 인도 또는 용역의 제공을 할 수 없을 때에는 지체없이 그 사유를 이용자에게 통지하고, 사전에 재화 또는 용역의 대금을 받은 경우에는 대금을 받은 날부터 2영업일 이내에 환급하거나 환급에 필요한 조치를 하여야 하고, 그렇지 않은 경우에는 재화등을 반환 받은 날부터 3영업일 이내에 이미 지급 받은 재화등의 대금을 환급하여야 합니다.
2. 다음 각 호의 경우에는 "쇼핑몰"은 배송된 재화일지라도 재화를 반품받은
다음 영업일 이내에 이용자의 요구에 따라 즉시 환급, 반품 및 교환 조치를 합니다.
다만 그 요구기한은 배송된 날로부터 20일 이내로 합니다.
① 배송된 재화가 주문내용과 상이하거나 "쇼핑몰"이 제공한 정보와 상이할 경우
② 배송된 재화가 파손, 손상되었거나 오염되었을 경우
③ 재화가 광고에 표시된 배송기간보다 늦게 배송된 경우
④ 전자상거래등에서의소비자보호에관한법률 제13조에 의하여 광고에 표시하여야 할 사항을 표시하지 아니한 상태에서 이용자의 청약이 이루어진 경우
단, 재화 등의 내용이 표시,광고 내용 또는 계약내용과 다르게 이행된 경우에는,
당해 재화를 공급받은 날부터 3개월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회를 할 수 있습니다. 
 
 제15조 (개인정보보호) 
 
 1. "쇼핑몰"은 이용자의 정보수집 시 '인종 및 민족', '출신 및 본적지' 등 기본적 인권을 침해할 우려가 있는 민감한 개인정보의 수집을 엄격히 제한하고 있으며 구매계약 이행에 필요한 최소한의 정보를 수집하되, 다음 사항을 필수사항으로 하고, 그 외 사항은 선택사항으로 합니다.
① 성명
② 주민등록번호 (회원의 경우)
③ 주소
④ 전화번호
⑤ 희망ID (회원의 경우)
⑥ 비밀번호 (회원의 경우)
⑦ email

2. "쇼핑몰"이 이용자의 개인식별이 가능한 개인정보를 수집하는 때에는 반드시 당해 이용자의 동의를 받습니다.
3. 제공된 개인정보는 당해 이용자의 동의 없이 목적 외의 이용이나 제3자에게 제공할 수 없으며, 이에 대한 모든 책임은 "쇼핑몰"이 집니다. 다만, 다음과 같은 경우에는 예외로 합니다.
① 배송업무상 배송업체에게 배송에 필요한 최소한의 이용자의 정보(성명, 주소, 전화번호)를 알려주는 경우
② 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공하는 경우

4. "쇼핑몰"이 제2항과 제3항에 의해 이용자의 동의를 받아야 하는 경우에는 개인정보관리 책임자의 신원(소속, 성명 및 전화번호 기타 연락처), 정보의 수집목적 및 이용목적, 제3자에 대한 정보제공 관련사항(제공받는자, 제공목적 및 제공할 정보의 내용)등 정보통신망이용촉진등에관한법률 제16조제3항이 규정한 사항을 미리 명시하거나 고지해야 하며 이용자는 언제든지 이 동의를 철회할 수 있습니다.
5. 이용자는 언제든지 "쇼핑몰"이 가지고 있는 자신의 개인정보에 대해 열람 및 오류정정을
요구할 수 있으며 "쇼핑몰"은 이에 대해 지체없이 필요한 조치를 취할 의무를 집니다.
이용자가 오류의 정정을 요구한 경우에는 "쇼핑몰"은 그 오류를 정정할 때까지 당해
개인정보를 이용하지 않습니다.
6. "쇼핑몰"은 개인정보 보호를 위하여 관리자를 한정하여 그 수를 최소화하며 신용카드,
은행계좌 등을 포함한 이용자의 개인정보의 분실, 도난, 유출, 변조 등으로 인한 이용자의 손해에 대하여 모든 책임을 집니다.
7. "쇼핑몰" 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집목적 또는 제공받은 목적을 달성한 때에는 당해 개인정보를 지체없이 파기합니다.
 
 제16조 ("몰"의 의무) 
 
 1. "쇼핑몰"은 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 재화·용역을 제공하는 데 최선의 노력을 합니다.
2. "쇼핑몰"은 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 아니하도록 안정성 확보에
필요한 기술적/제도적 대책을 수립하여 안전한 인터넷 서비스 이용을 도모합니다.
① "쇼핑몰"과 고객의 PC간의 결재정보를 SSL(Secure Socket Layer)을 통해 암호화하여
통신하고 있으며 Verysign을 통해 인증받고 있습니다.
② 해킹방지를 위해 자체 첨단 방화벽을 운영하고 있으며 실시간 바이러스 감시시스템을
가동하고 있습니다.
③ 전문 운영요원의 24시간 시스템 모니터링을 통한 서비스 다운타임 최소화를 위해 노력하고 있습니다.
④ 감사위원회의 감사활동을 통하여 문제가 발견된 경우 바로 시정조치하고 있습니다.
3. "쇼핑몰"이 상품이나 용역에 대하여 「표시·광고의공정화에관한법률」제3조 소정의 부당한 표시·광고행위를 함으로써 이용자가 손해를 입은 때에는 이를 배상할 책임을 집니다.
4. "쇼핑몰"은 이용자가 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.
 
 제17조 ( 회원의 ID 및 비밀번호에 대한 의무) 
 
1. 제15조의 경우를 제외한 ID와 비밀번호에 관한 관리책임은 회원에게 있습니다.
2. 회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
3. 회원이 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 "쇼핑몰"에 통보하고 "쇼핑몰"의 안내가 있는 경우에는 그에 따라야 합니다.
 
 제18조 (이용자의 의무) 
  
 이용자는 다음 행위를 하여서는 안됩니다.
① 신청 또는 변경 시 허위내용의 등록
② "쇼핑몰"에 게시된 정보의 변경
③ "쇼핑몰"이 정한 정보 이외의 정보(컴퓨터 프로그램 등)의 송신 또는 게시
④ "쇼핑몰" 기타 제3자의 저작권 등 지적재산권에 대한 침해
⑤ "쇼핑몰" 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
⑥ 외설 또는 폭력적인 메시지·화상·음성 기타 공서양속에 반하는 정보를 쇼핑몰에 공개 또는 게시하는 행위

 제19조 (연결"몰"과 피연결"몰" 간의 관계) 
  
 1. 상위 "쇼핑몰"과 하위 "쇼핑몰"이 하이퍼 링크(예: 하이퍼 링크의 대상에는 문자, 그림 및 동화상 등이 포함됨)방식 등으로 연결된 경우, 전자를 연결 "쇼핑몰"(웹 사이트)이라고 하고 후자를 피연결 "쇼핑몰"(웹사이트)이라고 합니다.
2. 연결 "쇼핑몰"은 피연결 "쇼핑몰"이 독자적으로 제공하는 재화·용역에 의하여 이용자와 행하는 거래에 대하여는 그 거래에 대한 보증책임을 지지 않는다는 내용을 쇼핑몰게시판을 통해 공지하며, 이 경우 당해 거래로 발생한 문제에 대하여 연결 "쇼핑몰"은 보증책임을 지지 않습니다.
 
 제20조 (저작권의 귀속 및 이용제한) 
 
 1. "쇼핑몰"이 작성한 저작물에 대한 저작권 기타 지적재산권은 회사에 귀속합니다.
2. 이용자는 "쇼핑몰"을 이용함으로써 얻은 정보를 "쇼핑몰"의 사전 승낙없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.

 제21조 (분쟁해결) 
 
 1. "쇼핑몰"은 이용자가 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상처리하기 위하여 피해보상처리기구를 설치·운영합니다.
2. "쇼핑몰"은 이용자로부터 제출되는 불만사항 및 의견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 즉시 통보해 드립니다.
3. "쇼핑몰"과 이용자간에 발생한 분쟁은 전자거래기본법 제28조 및 동 시행령 제15조에 의하여 설치된 전자거래분쟁조정위원회의 조정에 따를 수 있습니다.
  
 제22조 (재판권 및 준거법) 
 
1. "쇼핑몰"과 이용자간에 발생한 전자거래 분쟁에 관한 소송은 민사소송법상의 관할법원에 제기합니다.
2. "쇼핑몰"과 이용자간에 제기된 전자거래 소송에는 한국법을 적용합니다.
 2006년 6월 1일부터 시행합니다.`;

const 약관2 = `1. 수집하는 개인정보의 항목 및 수집방법
 회원가입, 비회원 구매, 상담, 불량이용의 방지 등을 위해 아래와 같은 개인정보를 수집하고 있습니다. 
 - 필수항목 : 성명, ID, 비밀번호, 생일/성별, 이메일, 연락처(휴대폰), 주소, 결제기록
 - 선택항목 : 개인맞춤 서비스를 제공하기 위하여 회사가 필요로 하는 정보
 - 수집방법 : 홈페이지
 
 2. 개인정보의 수집 및 이용목적
 수집한 개인정보는 다음의 목적을 위해 활용합니다.
 가. 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산, 콘텐츠 제공, 구매 및 요금 결제, 물품배송 또는 청구지 등 발송, 금융거래 본인 인증 및 금융서비스 
 나. 성명 , 아이디, 비밀번호: 회원제 서비스 이용에 따른 본인 확인 절차에 이용
 - 개인 식별, 불량회원의 부정 이용 방지와 비인가 사용 방지, 가입 의사 확인, 연령확인, 불만처리 등 고객 민원처리, 고지사항 전달  
 다. 서비스 및 이벤트 제공
 - 이메일주소, 전화번호 : 고지사항 전달, 불만처리, 부가서비스 등을 위한 원활한 의사소통 경로의 확보, 새로운 서비스 및 신상품이나 이벤트 정보 등의 안내       
 - 이름, 핸드폰번호 : 이벤트진행을 위해 이름, 핸드폰번호가 저장되어 이용됨.  
 라. 결제처리
 - 은행계좌정보, 신용카드정보 : 서비스 및 부가 서비스 이용에 대한 요금 결제
 - 주소, 전화번호 : 청구서, 물품배송시 정확한 배송지의 확보 
 -기타 선택항목 : 개인맞춤 서비스를 제공하기 위한 자료
 마. 부정이용 방지
 - IP Address : 불량회원의 부정 이용 방지와 비인가 사용 방지
 
 3. 개인정보의 보유 및 이용기간
 회원탈퇴 또는 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지제 없이 파기합니다. 다만, 서비스의 부정/불량이용자의 재가입  방지를 위해 해지 후 3개월간 보유할 수 있으며 전자상거래에서의 소비자보호에 관한법률 등 타 법률에 의해 보존의무가 있는경우에는 볍령이 지정한 일정기간 보존합니다.                            `;

export default function Page() {
  return (
    <main className="bg-base-100">
      <form action="/user/signup/register_form">
        {/* 타이틀 */}
        <h2 className="py-6 text-center text-2xl font-bold">이용약관</h2>

        {/* 회원가입약관 덩어리 */}
        <section className="container m-auto mb-6 max-w-4xl px-2">
          <h3 className="py-2 pl-4 font-bold">회원가입약관</h3>
          <textarea
            readOnly
            rows={10}
            className="w-full rounded-md border-[1px] bg-white p-4 text-xs"
            defaultValue={약관1}
          />
          <div className="dsy-form-control flex-row items-center justify-end gap-1 pl-4">
            <input
              id="username"
              type="checkbox"
              autoFocus
              className="dsy-checkbox dsy-checkbox-sm"
              required
            />
            <label htmlFor="username" className="dsy-label">
              <span className="dsy-label-text">회원가입약관을 읽었으며 내용에 동의합니다.</span>
            </label>
          </div>
        </section>

        {/* 개인정보처리방침 덩어리 */}
        <section className="container m-auto mb-6 max-w-4xl px-2">
          <h3 className="py-2 pl-4 font-bold">개인정보처리방침</h3>
          <textarea
            readOnly
            rows={10}
            className="w-full rounded-md border-[1px] bg-white p-4 text-xs"
            defaultValue={약관2}
          />
          <div className="dsy-form-control flex-row items-center justify-end gap-1 pl-4">
            <input
              id="username"
              type="checkbox"
              className="dsy-checkbox dsy-checkbox-sm"
              required
            />
            <label htmlFor="username" className="dsy-label">
              <span className="dsy-label-text">개인정보처리방침을 읽었으며 내용에 동의합니다.</span>
            </label>
          </div>
        </section>

        <div className="m-auto mb-6 flex">
          <button className="dsy-btn-wide dsy-btn mx-auto border-none bg-orange-200 shadow-lg">
            다음
          </button>
        </div>
      </form>
    </main>
  );
}
